withoutExtensionPrefilled/0/blueprints/wall_friction/k
    {
        type            kqRWallFunction;
        value           uniform 0.;
    }
