withoutExtensionPrefilled/system/controlDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Code template and library provided by Thorenz, C. (2024), DOI: 10.3929/ethz-b-000675949

// Include the boundary conditions
libs
(
    "lib_BAW_public_BCs_v2412_20250905.so"
);


//startFrom       latestTime;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         25;

deltaT          0.01;  // Initial time step length
adjustTimeStep  on;    // Adapt timestep based on Courant criterion                

maxCo       1.; //4   // Maximum Courant number. For RANS maxCo>1 is o.k., if these areas are checked later.
maxAlphaCo  1.; //2  // Maximum Courant number near the water surface. For maxAlphaCo>1 set fvSolution:alpha.water:nAlphaSubCycles to maxAlphaCo+1!
maxDeltaT   0.1;//0.05 // Maximum allowed time step length

writeControl    adjustableRunTime;  // Adapt timestep according to write intervals
writeInterval   0.1;                 // Write results every 0.1s 
purgeWrite      0;                  // Keep only the latest n results! (0 = all results)

writeFormat     binary; //HD-why not ascii?
writeCompression off;

timeFormat      general;
timePrecision   8;

runTimeModifiable on;


functions
{                                   
    //- Calculate and write CFL-numbers each time results are written    
    #include "functionObjects/CFL"

    //- Calculate extreme field values 
    #include "functionObjects/fieldMinMax"

    //- Calculates yPlus values on surfaces
    #include "functionObjects/yPlus"

    //- Writes out values of fields from cells nearest to specified locations (into postProcessing directory).
    #include "functionObjects/probes"
    
    //- Calculates the flow rate through a specified patch by summing the flux on patch faces.
    #include "functionObjects/patchWaterFlowRate"

}

